---
type: CircleLightShape
namespace: Autodesk.Revit.DB.Lighting
version: 2024
members: 3
tags: [revit-api, class]
---

# CircleLightShape

`Autodesk.Revit.DB.Lighting.CircleLightShape` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | CircleLightShape | — | `` |
| Constructor | CircleLightShape | 2013 | `public CircleLightShape ()` |
| Property | EmitDiameter | 2013 | `public double EmitDiameter { get ; set ; }` |